// yup
import { object, string } from 'yup';

// register authorization
const userRegisterSchema = object().shape({
	firstName: string()
		.min(3, 'طول نام باید حداقل ۳ حرف باشد!')
		.max(30, 'طول نام باید حداکثر ۳۰ حرف باشد!')
		.required('وارد کردن نام اجباری می‌باشد!'),
	lastName: string()
		.min(3, 'طول نام‌خانوادگی باید حداقل ۳ حرف باشد!')
		.max(30, 'طول نام‌خانوادگی باید حداکثر ۳۰ حرف باشد!')
		.required('وارد کردن نام‌خانوادگی اجباری می‌باشد!'),
	phoneNumber: string()
		.length(11, 'طول شماره‌تماس باید ۱۱ رقم باشد!')
		.matches('^09[0|1|2|3][0-9]{8}$', 'شماره‌تماس فقط باید متشکل از اعداد لاتین باشد!')
		.required('وارد کردن شماره‌تماس اجباری می‌باشد!'),
	email: string()
		.email('ساختار ایمیل وارد شده صحیح نمی‌باشد!')
		.required('وارد کردن ایمیل اجباری می‌باشد!'),
	username: string()
		.min(3, 'طول نام کاربری باید حداقل ۳ کاراکتر باشد!')
		.max(30, 'طول نام‌کاربری باید حداکثر ۳۰ کاراکتر باشد!')
		.required('وارد کردن نام‌کاربری اجباری می‌باشد!'),
	password: string()
		.min(8, 'طول رمزعبور باید حداقل ۸ کاراکتر باشد!')
		.required('وارد کردن رمزعبور اجباری می‌باشد!')
});

// exports
export { userRegisterSchema };
